require "pry-rails"

text = "(РЬДЬВЬЛ ЫЖХ) Й ВЭЫШДЕП ЙШЩКГШП ЩШАИДЙЭ Э ЙЬЮЩЬФЬЫКОВС ПЬШНЬ КЩЖНО. ЦЕДЬ ЬХЬДЬ ТШВЕЩШЗ ТОЙЬФ КУЭ, ХЬНКО ПЕ ЮЖЙВИДИЙС Ф ЮЖВС - ДШНЩОУ, БЮИВШЩ, ЙЬЦОХО И Э. БЮИВШЩ УШЙ ХЬЙЖ И ДЬЮОВЕ; ЬУ УОЙВЬЭД УО ЧВЬП УШ ЬВ ИРЦЕВХО ДБЦШРУЬЙВИ ИДИ ЫШ ЮЩИДШЫОУИЭ, УЬ, ХОХ Э ЮЬДОНОБ, ИР ЙВЩОЗО КЬФШЩИВС ЧВИ ЬЩЖКИЭ ЙФЬШПЖ НЬЙЮЬКИУЖ. ФИК Ж УШНЬ ЦЕД ЮЩШЖЮЩЭПЕЛ. \"ТШЩВЬФ ЫЖХ!\" - ФЬВ ШКИУЙВФШУУЬШ, ТВЬ Э ЖЙДЕАОД ЬВ УШНЬ РО ФЙШ ЮЖВШАШЙВФИШ. ПУШ ЮЬЩЖТИДИ КФО ЮЬВОЛУЕЗ МЬУОЩЭ. ДШНЩОУ УШЙ ЫЖХО. ЫЖХ ЦЕД ЮЩИФЭРОУ Х ХЬУГЖ АУЖЩО, Ю ДШНЩОУ ХЩЖВИД ШНЬ УО ЗЬКЖ, ХОХ РОХДИУОВШДС. ХЬНКО Э РОПШВИД ЧВЬ УЬФЬШ ЭФУЬШ КЬХОРОВШДСЙВФЬ ЦШРЖПИЭ ПЬШНЬ КЩЖНО, Э Й ВЩЖКЬП ЖКШЩЫОДЙЭ ЬВ ЙДШР. ВШП УШ ПШУШШ Э ЮЬХО ЩШАИД УИ Ф ТШП УШ ЮШЩШТИВС ДШНЩОУЖ И ЫКОВС ЙДЖТОЭ, ХЬНКО Э ЙПЬНЖ ЮЩШКЮЩИУЭВС ХОХИШ-ДИЦЬ ЧУШЩНИТУЕШ ПШЩЕ. Э ЮЬЮЕВОДЙЭ УШЙХЬДСХЬ ЩОР РОФЭРОВС ЦШЙШКЖ Ь ГШДЭЗ ЮЬЗЬКО, УЬ ЦШРЖЙЮШАУЬ. ЖНЬФЬЩИФ ПШУЭ ИКВИ ФПШЙВШ Й УИП И КЬФЬДСУЕЛ ЧВИП, ДШНЩОУ, ФИКИПЬ, УШ ЗЬВШД ЦЬДСАШ ФШЙВИ УИХОХИЗ ЩОРНЬФЬЩЬФ, И УО ФЙШ ПЬИ ЩОЙЙЮЩЬЙЕ ЬВФШТОД ЬКУЬЙДЬЫУЬ: \"ЖФИКИП!\" КЬЛКЭ КЬ ПЕЙО, ПЕ ЙШДИ Ф ЭДИХ И ЮШЩШЮЩОФИДИЙС УО ПОВШЩИХ. ЮЬВЬП ФРЬЦЩОДИЙС ЮЬ ФЕЙЬХЬПЖ ЦШЩШНЖ И, ФРЭФ УОЮЩОФДШУИШ УО ЙШФШЩЬ-РОЮОК, ЖНДЖЦИДИЙС Ф КИХИЛ, ЮЖЙВЕУУЕЛ ХЩОЛ, НКШ, ХОРОДЬЙС, УИХЬНКО УШ ЙВЖЮОДО УЬНО ТШДЬФШХО. ДШНЩОУ ЖФШЩШУУЬ ФШД УОЙ ФЮШЩШК, ДИАС ИРЩШКХО ЬЙВОУОФДИФОЭЙС И ЙФШЩЭЭЙС Й ЬЩИШУВИЩОПИ, ХЬВЬЩЕШ, ФИКИПЬ, РОЮЩИПШВИД, ЮЬЙШЯОЭ ЧВИ ПШЙВО КЬ ВЬНЬ. ВОХ ПЕ АДИ ТОЙО КФО, И УО РОХОВШ ЮШЩШК УОПИ ЬВХЩЕДОЙС ЖНЩБПОЭ ПШЙВУЬЙВС, ШЯШ ЦЬДШШ ПЩОТУОЭ, ТШП ФЙШ, ТВЬ ПЕ ФИКШДИ КЬ ЙИЗ ЮЬЩ. ЧВЬ ЦЕД ЩЬК ЮДОВЬ, ЩОЙХИУЖФАШНЬЙЭ Ж ЮЬКУЬЫСЭ ЮЬТВИ УШЮЩИЙВЖЮУЬНЬ ЙХДЬУО И ЮЬЩЬЙАШНЬ ДШЙЬП ЬВ УИРЖ КЬ ЙОПЬНЬ ФШЩЗО. ЙХДЬУ ЦЕД ЖЙШЭУ НЩЬПОКУЕПИ ФОДЖУОПИ, ХЬВЬЩЕШ, ХОРОДЬЙС, ИШ ЮОКОДИ ФУИР Ф КЬДИУЖ ДИАС ЮЬВЬПЖ, ТВЬ КШЩШФСЭ ЮЩШНЩОЫКОДИ ИП ЮЖВС. НДЖЦЬХИШ ЩОЙЙШДИУЕ ЮШЩШЙШХОДИ ЮДОВЬ ФЬ ФЙШЗ УОЮЩОФДШУИЭЗ И ЮЩИКОФОДИ ЮШЛРОЫЖ ШЯШ ЦЬДСАЖБ КИХЬЙВС. ЮДЬЙХЬНЬЩСШ, ЮЬ ХЬВЬЩЬПЖ ПЕ ЮЬКУИПОДИЙС, ЙЮДЬАС ЮЬЩЬЙДЬ ШЫШФИХЬЛ. ФЙХЬЩШ ЙВОДЬ ЭЙУЬ, ТВЬ ЦШР ХЬЙЕ УОП ЙХФЬРС РОЩЬЙДИ УШ ЮЩЬЦЩОВСЙЭ. ЮЬ ЮЩИХОРЖ ДШНЩОУО БЮИВШЩ ЙВОД ФЕХОАИФОВС КДЭ УОЙ ВЩЬЮИУХЖ Х ВБДСЮОУЬФЬПЖ КШЩШФЖ УШЬЦЕХУЬФШУУЬЛ ФЕЙЬВЕ, ХЬВЬЩЬШ ЙВЬЭДЬ, ЬХЩЖЫШУУЬШ КШЙЭВХЬП КЖЦЬФ, И КОДШХЬ ЮЩШФЬЙЗЬКИДЬ И ЧВИ КЖЦЕ, И ФЬЬЦЯШ ФЙШ КШЩШФСЭ, ХОХИШ ПУШ ЮЩИЗЬКИДЬЙС ХЬНКО-ДИЦЬ ФИКШВС, ЩОЙХИКИЙВЬЛ ХЩЬУЬЛ, ФШДИТОФЬЛ ХЩОЙЬВЬЛ ДИЙВФЕ И ГОЩЙВФШУУЬЙВСБ ЬЦЯИЗ ЬТШЩВОУИЛ. ХЬНКО ПЕ ЮЩИАДИ УОХЬУШГ Х ГШДИ, ДШНЩОУ ЬЦШЩУЖДЙЭ Х БЮИВШЩЖ И ЙЮЩЬЙИД, ЙПЬЫШВ ДИ ЬУ ФРЬЦЩОВСЙЭ УО ЧВЬ КШЩШФЬ. ЙВОЩИХ ЦЕД ЙЮШЩФО ЬРОКОТШУ ФЬЮЩЬЙЬП И УИТШНЬ УШ ЬВФШВИД. ЮЬВЬП, ЮЬКЬЛКЭ Х ДШЙУЬПЖ НИНОУВЖ, ЬУ ЬЦЬАШД ЙВФЬД ХЩЖНЬП, ФУИПОВШДСУЬ ФНДЭКЕФОЭЙС. <...> ФЬ ФЩШПЭ ЧВЬНЬ КИОДЬНО БЮИВШЩ ЦЕД ЙХЩЕВ ДИЙВФЬЛ КШЩШФО. УЬ ЫЖХ, ХЬВЬЩЬНЬ ЬУ ЙЮЖЙВИД ФУИР, ФИКУШДЙЭ ВШЮШЩС УО ХЬУГШ АУЖЩХО. РОЗЬКЭЯШШ ЙЬДУГШ ШЯШ ЬЙФШЯОДЬ ФЬРФЕАШУУЬЙВС, НКШ ПЕ ЙВЬЭДИ, И Ф ЮЬЙДШКУИЗ ШНЬ ДЖТОЗ ЫЖХ ЙФШЩХУЖД, ХОХ ЮЬДИЩЬФОУУЕЛ РЬДЬВЬЛ АОЩИХ. ЬУ ЙФЬЦЬКУЬ ЙФИЙОД ПШЫКЖ ФШВФШЛ КШЩШФО, И ШЙДИ Ц БЮИВШЩ ЙШЛТОЙ ЬВЮЖЙВИД АУЖЩЬХ, ВЬВ ЖЮОД ЦЕ ЮЩЭПЬ Х УОАИП УЬНОП. ДШНЩОУ ЦЕЙВЩЬ ЙЗФОВИД ХЬЙЖ И ЩОЙТИЙВИД ЖТОЙВЬХ КИОПШВЩЬП Ф КШФЭВС - КФШУОКГОВС МЖВЬФ, ЮЬЙДШ ТШНЬ ЬУ ФШДШД БЮИВШЩЖ ЬВЮЖЙВИВС АУЖЩЬХ И ЙДШРОВС ЮЬЙХЬЩШШ ФУИР. РОЦИФ ХЬДЕАШХ ВЬТУЬ Ф ВЬП ПШЙВШ, ХЖКО ЖЮОД ЫЖХ, ПЬЛ КЩЖН ФЕВОЯИД ИР ХОЩПОУО РШПДШПШЩУЖБ ДШУВЖ. ЮЩИХЩШЮИФ ШШ РО ХЬУШГ Х ЙВФЬДЖ КШЩШФО, ХОХ ЩОР УОЮЩЬВИФ РОЦИВЬНЬ ХЬДЕАХО, ЬУ ЮЩЬВЭУЖД ШШ ЮЩЭПЬ, КЬ ХЬДЕАХО, ЮЬЙДШ ТШНЬ, ЮЩЬКЬДЫОЭ ЩОРПОВЕФОВС ДШУВЖ И ЬВЙВЖЮОЭ УОРОК, ЬВПШЩИД ШЯШ ЮЭВСКШЙЭВ МЖВЬФ. БЮИВШЩ Й ХЬЙЬЛ Ф ЩЖХОЗ АШД ЮШЩШК УИП, ЙЩШРОЭ ХЖЙВЕ ШЫШФИХИ. КЬЛКЭ КЬ УЖЫУЬНЬ ПШЙВО, ДШНЩОУ РОЦИД ШЯШ ЬКИУ ХЬДЕАШХ И, ЮЩИУИПОЭ ШНЬ РО ГШУВЩ, ЬТИЙВИД ХЩЖН КИОПШВЩЬП ЮЩИПШЩУЬ Ф ТШВЕЩШ МЖВО. ЮЬВЬП ЬУ КОД ЮЬ ДЬЮОВШ ПУШ И БЮИВШЩЖ, ЙОП ФРЭД ДЬЮОВЖ И ЮЩИХОРОД УОП ХЬЮОВС."
text = text.split("")

@dec_alphabet = {
  "А"=> "ш",
  "Б"=> "*",
  "В"=> "т",
  "Г"=> "ц",
  "Д"=> "л",
  "Е"=> "ы",
  "Ж"=> "у",
  "З"=> "х",
  "И"=> "и",
  "Й"=> "с",
  "К"=> "д",
  "Л"=> "й",
  "М"=> "*",
  "Н"=> "г",
  "О"=> "а",
  "П"=> "м",
  "Р"=> "з",
  "С"=> "ь",
  "Т"=> "ч",
  "У"=> "н",
  "Ф"=> "в",
  "Х"=> "к",
  " "=> "б",
  "Ч"=> "э",
  "Ш"=> "е",
  "Щ"=> "р",
  "Ы"=> "ж",
  "Ь"=> "о",
  "Э"=> "я",
  "Ю"=> "п",
  "Я"=> "",
  " "=> " "
}

def solution(text)
  decipher_text = []
  text.each_with_index do |value|
    decipher_text << @dec_alphabet[value.to_s.downcase]
  end
  p decipher_text.join("")
end

solution(text)

# "золотой жук с тяжелым сердцем решился я сопровождать моего друга ыло около четырех часов дня когда мы пустились в путь
# легран *питер соака и я *питер нес косу и лопаты он настоял на этом не от изытка л*езности или же прилежания но как я полага*
# из страха доверить эти орудия своему господину вид у него ыл преупрямый чертов жук  вот единственное что я услышал от него за
# все путешествие мне поручили два потайных *онаря легран нес жука жук ыл привязан к концу шнура п легран крутил его на ходу как
# заклинатель когда я заметил это новое явное доказательство езумия моего друга я с трудом удержался от слез тем не менее я пока решил
# ни в чем не перечить леграну и ждать случая когда я смогу предпринять какиелио энергичные меры я попытался несколько раз завязать
# еседу о целях похода но езуспешно уговорив меня идти вместе с ним и довольный этим легран видимо не хотел ольше вести никаких
# разговоров и на все мои расспросы отвечал односложно увидим дойдя до мыса мы сели в ялик и переправились на материк потом взорались
# высокому ерегу и взяв направление на северозапад углуились в дикий пустынный край где казалось никогда не ступала нога человека
# легран уверенно вел нас вперед лишь изредка останавливаясь и сверяясь с ориентирами которые видимо заприметил посеая эти места до
# того так мы шли часа два и на закате перед нами открылась угр*мая местность ее олее мрачная чем все что мы видели до сих пор это ыл
# род плато раскинувшегося у подножья почти неприступного склона и поросшего лесом от низу до самого верха склон ыл усеян громадными валунами
# которые казалось ие падали вниз в долину лишь потому что деревья преграждали им путь глуокие расселины пересекали плато во всех направлениях
# и придавали пейзажу ее ольшу* дикость плоскогорье по которому мы поднимались сплошь поросло ежевикой вскоре стало ясно что ез косы нам сквозь
# заросли не прораться по приказу леграна *питер стал выкашивать для нас тропинку к т*льпановому дереву неоыкновенной высоты которое стояло
# окруженное десятком дуов и далеко превосходило и эти дуы и воое все деревья какие мне приходилось когдалио видеть раскидистой кроной величавой
# красотой листвы и царственность* оих очертаний когда мы пришли наконец к цели легран оернулся к *питеру и спросил сможет ли он взораться на это
# дерево старик ыл сперва озадачен вопросом и ничего не ответил потом подойдя к лесному гиганту он оошел ствол кругом внимательно вглядываясь
# во время этого диалога *питер ыл скрыт листвой дерева но жук которого он спустил вниз виднелся теперь на конце шнурка заходяее солнце ее
# освеало возвышенность где мы стояли и в последних его лучах жук сверкнул как полированный золотой шарик он своодно свисал между ветвей дерева
# и если  *питер сейчас отпустил шнурок тот упал ы прямо к нашим ногам легран ыстро схватил косу и расчистил участок диаметром в девять
# двенадцать *утов после чего он велел *питеру отпустить шнурок и слезать поскорее вниз заив колышек точно в том месте куда упал жук мой
# друг вытаил из кармана землемерну* ленту прикрепив ее за конец к стволу дерева как раз напротив заитого колышка он протянул ее прямо до
# колышка после чего продолжая разматывать ленту и отступая назад отмерил ее пятьдесят *утов *питер с косой в руках шел перед ним срезая
# кусты ежевики дойдя до нужного места легран заил ее один колышек и принимая его за центр очистил круг диаметром примерно в четыре *ута
# потом он дал по лопате мне и *питеру сам взял лопату и приказал нам копать"
